###################################################################

# Created by write_sdc on Thu Feb 21 21:49:32 2019

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current uA
set_load -pin_load 15 [get_ports compute_done]
set_load -pin_load 15 [get_ports {cycles_count[15]}]
set_load -pin_load 15 [get_ports {cycles_count[14]}]
set_load -pin_load 15 [get_ports {cycles_count[13]}]
set_load -pin_load 15 [get_ports {cycles_count[12]}]
set_load -pin_load 15 [get_ports {cycles_count[11]}]
set_load -pin_load 15 [get_ports {cycles_count[10]}]
set_load -pin_load 15 [get_ports {cycles_count[9]}]
set_load -pin_load 15 [get_ports {cycles_count[8]}]
set_load -pin_load 15 [get_ports {cycles_count[7]}]
set_load -pin_load 15 [get_ports {cycles_count[6]}]
set_load -pin_load 15 [get_ports {cycles_count[5]}]
set_load -pin_load 15 [get_ports {cycles_count[4]}]
set_load -pin_load 15 [get_ports {cycles_count[3]}]
set_load -pin_load 15 [get_ports {cycles_count[2]}]
set_load -pin_load 15 [get_ports {cycles_count[1]}]
set_load -pin_load 15 [get_ports {cycles_count[0]}]
set_load -pin_load 15 [get_ports {pe_register_vals[0]}]
set_load -pin_load 15 [get_ports {pe_register_vals[1]}]
set_load -pin_load 15 [get_ports {pe_register_vals[2]}]
set_load -pin_load 15 [get_ports {pe_register_vals[3]}]
set_load -pin_load 15 [get_ports {pe_register_vals[4]}]
set_load -pin_load 15 [get_ports {pe_register_vals[5]}]
set_load -pin_load 15 [get_ports {pe_register_vals[6]}]
set_load -pin_load 15 [get_ports {pe_register_vals[7]}]
set_load -pin_load 15 [get_ports {pe_register_vals[8]}]
set_load -pin_load 15 [get_ports {pe_register_vals[9]}]
set_load -pin_load 15 [get_ports {pe_register_vals[10]}]
set_load -pin_load 15 [get_ports {pe_register_vals[11]}]
set_load -pin_load 15 [get_ports {pe_register_vals[12]}]
set_load -pin_load 15 [get_ports {pe_register_vals[13]}]
set_load -pin_load 15 [get_ports {pe_register_vals[14]}]
set_load -pin_load 15 [get_ports {pe_register_vals[15]}]
set_load -pin_load 15 [get_ports {pe_register_vals[16]}]
set_load -pin_load 15 [get_ports {pe_register_vals[17]}]
set_load -pin_load 15 [get_ports {pe_register_vals[18]}]
set_load -pin_load 15 [get_ports {pe_register_vals[19]}]
set_load -pin_load 15 [get_ports {pe_register_vals[20]}]
set_load -pin_load 15 [get_ports {pe_register_vals[21]}]
set_load -pin_load 15 [get_ports {pe_register_vals[22]}]
set_load -pin_load 15 [get_ports {pe_register_vals[23]}]
set_load -pin_load 15 [get_ports {pe_register_vals[24]}]
set_load -pin_load 15 [get_ports {pe_register_vals[25]}]
set_load -pin_load 15 [get_ports {pe_register_vals[26]}]
set_load -pin_load 15 [get_ports {pe_register_vals[27]}]
set_load -pin_load 15 [get_ports {pe_register_vals[28]}]
set_load -pin_load 15 [get_ports {pe_register_vals[29]}]
set_load -pin_load 15 [get_ports {pe_register_vals[30]}]
set_load -pin_load 15 [get_ports {pe_register_vals[31]}]
set_load -pin_load 15 [get_ports {pe_register_vals[32]}]
set_load -pin_load 15 [get_ports {pe_register_vals[33]}]
set_load -pin_load 15 [get_ports {pe_register_vals[34]}]
set_load -pin_load 15 [get_ports {pe_register_vals[35]}]
set_load -pin_load 15 [get_ports {pe_register_vals[36]}]
set_load -pin_load 15 [get_ports {pe_register_vals[37]}]
set_load -pin_load 15 [get_ports {pe_register_vals[38]}]
set_load -pin_load 15 [get_ports {pe_register_vals[39]}]
set_load -pin_load 15 [get_ports {pe_register_vals[40]}]
set_load -pin_load 15 [get_ports {pe_register_vals[41]}]
set_load -pin_load 15 [get_ports {pe_register_vals[42]}]
set_load -pin_load 15 [get_ports {pe_register_vals[43]}]
set_load -pin_load 15 [get_ports {pe_register_vals[44]}]
set_load -pin_load 15 [get_ports {pe_register_vals[45]}]
set_load -pin_load 15 [get_ports {pe_register_vals[46]}]
set_load -pin_load 15 [get_ports {pe_register_vals[47]}]
set_load -pin_load 15 [get_ports {pe_register_vals[48]}]
set_load -pin_load 15 [get_ports {pe_register_vals[49]}]
set_load -pin_load 15 [get_ports {pe_register_vals[50]}]
set_load -pin_load 15 [get_ports {pe_register_vals[51]}]
set_load -pin_load 15 [get_ports {pe_register_vals[52]}]
set_load -pin_load 15 [get_ports {pe_register_vals[53]}]
set_load -pin_load 15 [get_ports {pe_register_vals[54]}]
set_load -pin_load 15 [get_ports {pe_register_vals[55]}]
set_load -pin_load 15 [get_ports {pe_register_vals[56]}]
set_load -pin_load 15 [get_ports {pe_register_vals[57]}]
set_load -pin_load 15 [get_ports {pe_register_vals[58]}]
set_load -pin_load 15 [get_ports {pe_register_vals[59]}]
set_load -pin_load 15 [get_ports {pe_register_vals[60]}]
set_load -pin_load 15 [get_ports {pe_register_vals[61]}]
set_load -pin_load 15 [get_ports {pe_register_vals[62]}]
set_load -pin_load 15 [get_ports {pe_register_vals[63]}]
create_clock [get_ports clk]  -name clk_input  -period 1000  -waveform {0 500}
set_clock_uncertainty 0.2  [get_clocks clk_input]
set_input_delay -clock clk_input  50  [get_ports rst]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[0]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[1]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[2]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[3]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[4]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[5]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[6]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[7]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[8]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[9]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[10]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[11]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[12]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[13]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[14]}]
set_input_delay -clock clk_input  50  [get_ports {top_inputs[15]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[0]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[1]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[2]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[3]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[4]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[5]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[6]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[7]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[8]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[9]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[10]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[11]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[12]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[13]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[14]}]
set_input_delay -clock clk_input  50  [get_ports {left_inputs[15]}]
set_output_delay -clock clk_input  50  [get_ports compute_done]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[15]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[14]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[13]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[12]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[11]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[10]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[9]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[8]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[7]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[6]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[5]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[4]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[3]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[2]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[1]}]
set_output_delay -clock clk_input  50  [get_ports {cycles_count[0]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[0]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[1]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[2]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[3]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[4]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[5]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[6]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[7]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[8]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[9]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[10]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[11]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[12]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[13]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[14]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[15]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[16]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[17]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[18]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[19]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[20]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[21]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[22]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[23]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[24]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[25]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[26]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[27]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[28]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[29]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[30]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[31]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[32]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[33]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[34]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[35]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[36]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[37]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[38]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[39]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[40]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[41]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[42]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[43]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[44]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[45]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[46]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[47]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[48]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[49]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[50]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[51]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[52]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[53]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[54]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[55]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[56]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[57]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[58]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[59]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[60]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[61]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[62]}]
set_output_delay -clock clk_input  50  [get_ports {pe_register_vals[63]}]
